Revit 2027 API
BuiltInFailures.WallFailures.ExtrudedWallDisallowedForCrossSectionType Property
 Edited profiles are not allowed for this wall's cross-section type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ExtrudedWallDisallowedForCrossSectionType { get; }
Public Shared ReadOnly Property ExtrudedWallDisallowedForCrossSectionType As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ExtrudedWallDisallowedForCrossSectionType {
	FailureDefinitionId^ get ();
}
static member ExtrudedWallDisallowedForCrossSectionType : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace